{
    "basics": {
      "name": "Patrick Webster",
      "label": "Software Developer",
      "picture": "headshot.jpg",
      "email": "ptwbstr@gmail.com",
      "phone": "506-962-2619",
      "website": "",
      "summary": "Software Engineer with 5+ years experience building software applications. I am a full stack developer with a passion for frontend web-based technologies. Extensive experience improving code quality through automated tests. I am looking for new challenges where I can learn new technologies and bringing my previous experience to a motivated team.",
      "location": {
        "city": "Moncton",
        "countryCode": "Canada"
      },
      "profiles": [
        {
          "network": "LinkedIn",
          "username": "Patrick Webster",
          "url": "https://www.linkedin.com/in/ptwbstr"
        },
        {
          "network": "Github",
          "username": "webstp",
          "url": "https://github.com/webstp"
        }
      ]
    },
    "work": [
      {
        "company": "FrontLobby",
        "website": "https://frontlobby.com",
        "position": "Senior Fullstack Web Developer",
        "startDate": "2020-08-20",
        "summary": "FrontLobby, a PropTech company, is helping improve renting for everyone by empowering Landlords and Property Managers while enriching the lives of responsible Tenants",
        "highlights": [
          "Built, maintained and improved a custom build pipeline using webpack",
          "Designed and built integrations with Credit Bureaus to provide access to consumer files",
          "Responsible for suite of automated tests leveraging WDIO, Mocha and Sinon",
          "Managed junior developers, providing feedback and guidance through code reviews and 1 on 1 meetings",
          "Leveraged technologies such as Docker, NodeJS, Typescript, Vue"
        ]
      },
      {
        "company": "Akiri",
        "website": "https://akiri.com/",
        "position": "Senior Software Engineer",
        "startDate": "2017-12-18",
        "endDate": "2020-07-15",
        "summary": "Worked at Akiri, a healthcare networking start-up, building a cloud-based product aimed at resolving the problems around the exchanging of healthcare data.",
        "highlights": [
          "Responsible for leading the development of the UI.",
          "Design and built an authentication solution around Auth0. This includes email notification around password management.",
          "Responsible for Unit and E2E testing of UI using Jest and Cypress.",
          "Responsible for security and performance optimization of the web-based UI.",
          "Mentored junior developers by providing code reviews, feedback and advising on UI design.",
          "Leveraged technologies such as Docker, Kotlin, Vertx, Vue, and Vuetify."
        ]
      },
      {
        "company": "Dell EMC",
        "website": "https://dellemc.com",
        "position": "Software Engineer",
        "startDate": "2016-11-15",
        "endDate": "2017-12-18",
        "summary": "Worked with a team building a product codenamed Nautilus, a real-time analytics platform that combines the power of Apache Flink and Pravega, a new open source project for streaming storage.",
        "highlights": [
          "Built, maintained and improved a custom webpack pipeline",
          "Designed and built a web-based UI for the management and monitoring of Pravega and Flink",
          "Built a monitoring solution based on the influx TICK stack on top of DCOS.",
          "Designed and built live charts to view the real-time streaming data.",
          "Built an tool to track and record npm open source dependencies licenses.",
          "Responsible for Unit and E2E testing of UI using Protractor and Jasmine.",
          "Leveraged technologies such as Mesos, DCOS, Docker, InfluxDB, and Angular."
        ]
      },
      {
        "company": "EMC Corporation",
        "position": "Software Engineer",
        "startDate": "2014-05-15",
        "endDate": "2016-11-15",
        "summary": "Worked on a UI team building Neutrino, an appliance that provided a turn-key OpenStack cluster.",
        "highlights": [
          "Built, maintained and improved a custom webpack pipeline",
          "Built a web-based UI for installation, upgrade, monitoring and management of container services.",
          "Built a task monitoring solution that enabled visibility into service deployment.",
          "Championed a migration of the the UI from AngularJS to Angular 2 using a phased approach.",
          "Implemented a web-based version of ScaleIO's UI using AngularJS.",
          "Built a solution around Websockets for keeping UI instances in sync.",
          "Leveraged technologies such as Docker, Java, Angular, Websockets, and RxJS."
        ]
      }
    ],
    "education": [
      {
        "institution": "St. Francis Xavier University",
        "area": "Computer Science",
        "studyType": "Bachelor of Science (B.S.)",
        "startDate": "2006-12-31",
        "endDate": "2010-12-31"
      }
    ],
    "skills": [
      {
        "name": "Programming",
        "keywords": [
          "Kotlin",
          "Java",
          "Javascript",
          "Typescript",
          "Python"
        ]
      },
      {
        "name": "Web Technologies",
        "keywords": [
          "HTML5",
          "SASS/LESS/CSS",
          "NodeJS",
          "TypeORM",
          "Angular",
          "RxJS",
          "WebSockets",
          "Vue"
        ]
      },
      {
        "name": "Infrastructure",
        "keywords": [
          "Docker",
          "Kubernetes",
          "Terraform",
          "Amazon Web Services"
        ]
      },
      {
        "name": "Developer Tools",
        "keywords": [
          "Git",
          "VS Code",
          "Jenkins",
          "JIRA",
          "Github",
          "BitBucket"
        ]
      }
    ],
    "languages": [
      {
        "language": "English",
        "fluency": "Native Speaker"
      }, 
      {
        "language": "French",
        "fluency": "Intermediate"
      }
    ],
    "interests": [
      {
        "name": "Home Automation",
        "keywords": [
          "Home Assistant",
          "Raspberry Pi"
        ]
      },
      {
        "name": "Board Games",
        "keywords": [
          "Ticket to Ride",
          "Catan",
          "Betrayal at House on the Hill",
          "Diplomacy"
        ]
      },
      {
        "name": "Reading",
        "keywords": [
          "Wheel of Time",
          "The Belgariad",
          "The Mallorean",
          "Enders Saga",
          "Sword of Truth",
          "The Mither Mages",
          "The Magicians"
        ]
      }
    ]
  }